### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be updated in-place
!   resource "aws_apigatewayv2_api" "this" {
        id                           = "qkcy9ocpg8"
!       name                         = "Cataprato_http" -> "cataprato-http"
!       tags                         = {
+           "Deployment" = "terraform"
        }
!       tags_all                     = {
+           "Deployment" = "terraform"
        }
-       version                      = "v1" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "balcony-frontend"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
+   resource "aws_s3_bucket_acl" "this" {
+       acl                   = "public-read"
+       bucket                = (known after apply)
+       expected_bucket_owner = "350131064538"
+       id                    = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_ownership_controls.this[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_website_configuration.this[0] will be created
+   resource "aws_s3_bucket_website_configuration" "this" {
+       bucket                = (known after apply)
+       expected_bucket_owner = "350131064538"
+       id                    = (known after apply)
+       routing_rules         = (known after apply)
+       website_domain        = (known after apply)
+       website_endpoint      = (known after apply)

+       error_document {
+           key = "error.html"
        }

+       index_document {
+           suffix = "index.html"
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```
</details>